#include "timer.h"
#include <REGX52.H>


/****************************************************************************************************
//说明:51单片机定时器使用说明
//接口定义:
//位寻址: 
*****************************************************************************************************/
unsigned int T0Countms;
unsigned int T0Count_100ms;


void timer0_init(void)
{
    //定时器配置
    //TMOD = 0x01;   //0000 0001
    TMOD = TMOD & 0xF0;   //低四位清零，高四位不变
    TMOD = TMOD | 0x01;
    TF0 = 0;
    TR0 = 1;
    //赋初值65535-64535=1000us=1ms
    TH0 = 64535/256;   //取出高八位
    TL0 = 64535%256+1; //取出低八位

    //中断配置
    ET0 = 1;
    EA = 1 ;
    PT0=0;
}

//被串口占用
void timer1_init(void)
{
    

}



void timer2_init(void)
{
    

}

//定时器0中断函数(每1ms进入一次中断函数)
void Timer0_Routine() interrupt 1
{
    //重新赋初值
    TH0 = 64535/256;     //取出高八位
    TL0 = 64535%256+1;   //取出低八位
    T0Countms++;
    if(T0Countms>=100)
    {
        T0Count_100ms++;
    }
}